{
    "projects": [
        {
            "title": "Xorn: The Fallen God",
            "img": "https://img.itch.zone/aW1nLzE0NTk2ODYucG5n/original/2jvC%2Bg.png",
            "youtube": "12cMKGWWdwI",
            "resume": [
                "Xorn: the fallen god est le jeu dont je suis le plus fier d'avoir participé. C'est le premier jeu fait en équipe, nous étions quatre, deux développeurs, un game designer et un graphiste. Je me suis principalement concentré sur l'intelligence artificielle et quelques éléments de gameplay."
            ],
            "text": [
                "Le but du jeu est de survivre le plus longtemps possible à des vagues d'ennemies tout en évitant de tomber dans les trous qui se crée sur le terrain au fur et à mesure.",
                "Nous avons utilisé le moteur de jeu Unity pour pouvoir travailler ensemble de façon efficace. Les models 3D ont étaient créé via Blender, et nous avons utilisé Inkscape pour l'interface utilisateur. Tout le code est en C# et nous n'avons pas utilisé de bibliothèque externe particulière",
                "### Téléchargement : ",
                "[Xorn: The Fallen God](https://ldjam.com/events/ludum-dare/42/xorn-the-fallen-god)"
            ]
        },
        {
            "title": "Minecraft Hardcore - modding",
            "youtube": "LhwsNXeCMJk",
            "resume": [
                "Minecraft Hardcore a grandement fait partie de mes décisions concernant mon orientation. Ayant appris à programmer en modifiant le jeu Minecraft, Minecraft Hardcore m'a apporté, au travers ses différentes saisons, de la matière concernant mon apprentissage dans le domaine tout en faisant partie d'une équipe régulièrement renouveler"
            ],
            "text": [
                "Minecraft Hardcore est une série de vidéos sur Youtube contenant plus de 13 saisons. L'instigateur de ce concepte est *Iplay4You*.",
                "Le concepte de départ consisté à survivre au monde de Minecraft, avec une seule vie et plusieurs mods ajoutant des créatures et autres joyeusetés. Un mod est un programme créer par un membre de la communauté d'un jeu permettant de modifier voir d'ajouter des éléments au jeu d'origine. Minecraft en possède de nombreux tels que Mo'Créature, BuildCraft, etc...",
                "A partir de la saison 4, les choses changent. Une équipe se forme autours du concepte et l'idée de créer des maps thématique arrive alors, ce fut un succès. Dans la même lancé, la saison 5 ajoute son lot de nouveauté, c'est aussi l'apparition de mon premier mod (qui a l'époque n'avait pas été fait sur mesure). Durant la diffusion de la saison 5, la Team4Iplay me contacta et ce fut le début d'une grande aventure. La création d'un mod sur mesure fut créer pour la saison 7 qui avait pour thème : Pirate des Caraïbes (Pirate des cuboïdes).",
                "Les saisons s'enchainèrent alors, la saison 8 sur 3 tomes se consacra au monde du *Seigneur des Anneaux*, la saison 10 fut ma dernière et reprennait le monde de *Pirate des Caraïbes*",
                "### La chaîne Youtube d'Iplay4You",
                "[Iplay4You31](https://www.youtube.com/user/iplay4you31)"
            ]
        },
        {
            "title": "Beneath the surface - LDJAM 29",
            "img": "http://ludumdare.com/compo/wp-content/compo2//342546/15933-shot0.png-crop-180-140.jpg",
            "resume": [
                "Beneath the surface est un jeu créé en 48h, d'ailleurs c'est probablement le premier jeu que j'ai réalisé, de plus en solitaire.",
                "Le but du jeu est de retrouver la sortie de la zone en évitant de se faire tuer par les quelques monstres qui pueplent les profondeurs. Pour y arriver, vous devez utiliser les différents sorts mis à votre disposition.",
                "Bonne chance"
            ],
            "text": [
                "Ce projet était vraiment un de mes tout premier qui ne ressemblaient pas aux projet que j'avais l'habitude d'avoir sur Minecraft. De plus, la limite de temps imposée nous oblige à réfléchir différemment et de se munir de beaucoup d'inventivité.",
                "Le jeu a été réalisé en Java, sans bibliothèques externe. Le tout est basé sur java.awt",
                "### Téléchagement : ",
                "[Beneathe the surface](http://ludumdare.com/compo/ludum-dare-29/?action=preview&uid=15933)"
            ]
        }
    ]
}